# CableTrayType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTrayType Class
Members See Also
---
This class represents a cable tray type in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class CableTrayType : MEPCurveType
```

Visual Basic
---
```text
Public Class CableTrayType _
	Inherits MEPCurveType
```

Visual C++
---
```text
public ref class CableTrayType : public MEPCurveType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..HostObjAttributes Autodesk.Revit.DB..::..MEPCurveType Autodesk.Revit.DB.Electrical..::..CableTrayType
# See Also
CableTrayType Members
Autodesk.Revit.DB.Electrical Namespace